Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.harbor.harbor_garbage_collection.gc-schedule will be created
+ resource "harbor_garbage_collection" "gc-schedule" {
      + id       = (known after apply)
      + schedule = "Daily"
      + workers  = 1
    }

  # module.harbor.harbor_project.fetch-system will be created
+ resource "harbor_project" "fetch-system" {
      + auto_sbom_generation        = false
      + enable_content_trust        = false
      + enable_content_trust_cosign = false
      + force_destroy               = false
      + id                          = (known after apply)
      + name                        = "fetch-system"
      + project_id                  = (known after apply)
      + public                      = true
      + registry_id                 = (known after apply)
      + storage_quota               = -1
      + vulnerability_scanning      = true
    }

  # module.harbor.harbor_retention_policy.fetch-system-retention will be created
+ resource "harbor_retention_policy" "fetch-system-retention" {
      + id       = (known after apply)
      + schedule = "Daily"
      + scope    = (known after apply)

      + rule {
          + disabled             = false
          + most_recently_pushed = 2
          + repo_matching        = "**"
          + untagged_artifacts   = true
        }
    }

  # module.harbor.helm_release.harbor will be updated in-place
~ resource "helm_release" "harbor" {
        id                         = "harbor"
      ~ metadata                   = [
          - {
              - app_version    = "2.11.0"
              - chart          = "harbor"
              - first_deployed = 1738075187
              - last_deployed  = 1738075187
              - name           = "harbor"
              - namespace      = "harbor"
              - notes          = <<-EOT
                    Please wait for several minutes for Harbor deployment to complete.
                    Then you should be able to visit the Harbor portal at https://registry.goboolean.io
                    For more details, please visit https://github.com/goharbor/harbor
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - expose      = {
                          - tls  = {
                              - enabled = false
                            }
                          - type = "clusterIP"
                        }
                      - externalURL = "https://registry.goboolean.io"
                    }
                )
              - version        = "1.15.0"
            },
        ] -> (known after apply)
        name                       = "harbor"
      ~ values                     = [
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change.
          ~ (sensitive value),
        ]
      ~ version                    = "1.15.0" -> "1.15.1"
        # (25 unchanged attributes hidden)
    }

  # module.kafka.helm_release.kafka will be updated in-place
~ resource "helm_release" "kafka" {
        id                         = "kafka"
        name                       = "kafka"
      ~ timeout                    = 300 -> 600
        # (27 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 3 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
